In [1]:
import pandas as pd
import numpy as np

np.random.seed(42)

n = 1000

df = pd.DataFrame({
    "user_id": np.random.randint(1, 300, n),
    "city": np.random.choice(
        [" İstanbul", "ANKARA ", "Izmir", "Bursa ", "istanbul"], n
    ),
    "price": np.random.choice(
        ["100", "200", "300", "N/A", "400"], n
    ),
    "rating": np.round(np.random.uniform(1, 5, n), 1)
})

df.head()

   user_id       city price  rating
0      103      Izmir   400     4.9
1      271    ANKARA    N/A     2.2
2      107   İstanbul   200     4.8
3       72      Izmir   100     2.6
4      189    ANKARA    400     2.5

In [2]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   user_id  1000 non-null   int64
 1   city     1000 non-null   object
 2   price    1000 non-null   object
 3   rating   1000 non-null   float64
dtypes: float64(1), int64(1), object(2)
memory usage: 31.4+ KB

In [ ]:
df.isnull().sum()

In [3]:
df["price"] = pd.to_numeric(df["price"], errors="coerce")

In [4]:
median_price = df["price"].median()
df["price"] = df["price"].fillna(median_price)

In [5]:
df["city"] = df["city"].str.strip()
df["city"] = df["city"].str.lower()
df["city"] = (
    df["city"]
    .str.replace("ı", "i")
    .str.replace("i̇", "i")
)

In [6]:
df["city"].value_counts()

city
istanbul    403
ankara      214
bursa       196
izmir       187
Name: count, dtype: int64

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   user_id  1000 non-null   int64
 1   city     1000 non-null   object
 2   price    1000 non-null   float64
 3   rating   1000 non-null   float64
dtypes: float64(2), int64(1), object(1)
memory usage: 31.4+ KB

In [8]:
df.duplicated().sum()

np.int64(5)

In [9]:
df.head()

   user_id      city  price  rating
0      103     izmir  400.0     4.9
1      271    ankara  300.0     2.2
2      107  istanbul  200.0     4.8
3       72     izmir  100.0     2.6
4      189    ankara  400.0     2.5